apache/nuttx/arch/arm/src/rp2040/hardware/rp2040_dma.h
/****************************************************************************
 * arch/arm/src/rp2040/hardware/rp2040_dma.h
 *
 * Generated from rp2040.svd originally provided by
 *   Raspberry Pi (Trading) Ltd.
 *
 * Copyright 2020 (c) 2020 Raspberry Pi (Trading) Ltd.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_RP2040_HARDWARE_RP2040_DMA_H
#define __ARCH_ARM_SRC_RP2040_HARDWARE_RP2040_DMA_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "hardware/rp2040_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define RP2040_DMA_READ_ADDR_OFFSET                  0x000000  /* DMA Read Address pointer */
#define RP2040_DMA_WRITE_ADDR_OFFSET                 0x000004  /* DMA Write Address pointer */
#define RP2040_DMA_TRANS_COUNT_OFFSET                0x000008  /* DMA Transfer Count */
#define RP2040_DMA_CTRL_TRIG_OFFSET                  0x00000c  /* DMA Control and Status */
#define RP2040_DMA_AL1_CTRL_OFFSET                   0x000010  /* Alias for CTRL register */
#define RP2040_DMA_AL1_READ_ADDR_OFFSET              0x000014  /* Alias for READ_ADDR register */
#define RP2040_DMA_AL1_WRITE_ADDR_OFFSET             0x000018  /* Alias for WRITE_ADDR register */
#define RP2040_DMA_AL1_TRANS_COUNT_TRIG_OFFSET       0x00001c  /* Alias for TRANS_COUNT register */
#define RP2040_DMA_AL2_CTRL_OFFSET                   0x000020  /* Alias for CTRL register */
#define RP2040_DMA_AL2_TRANS_COUNT_OFFSET            0x000024  /* Alias for TRANS_COUNT register */
#define RP2040_DMA_AL2_READ_ADDR_OFFSET              0x000028  /* Alias for READ_ADDR register */
#define RP2040_DMA_AL2_WRITE_ADDR_TRIG_OFFSET        0x00002c  /* Alias for WRITE_ADDR register */
#define RP2040_DMA_AL3_CTRL_OFFSET                   0x000030  /* Alias for CTRL register */
#define RP2040_DMA_AL3_WRITE_ADDR_OFFSET             0x000034  /* Alias for WRITE_ADDR register */
#define RP2040_DMA_AL3_TRANS_COUNT_OFFSET            0x000038  /* Alias for TRANS_COUNT register */
#define RP2040_DMA_AL3_READ_ADDR_TRIG_OFFSET         0x00003c  /* Alias for READ_ADDR register */

#define RP2040_DMA_INTR_OFFSET                       0x000400  /* Interrupt Status (raw) */
#define RP2040_DMA_INTE0_OFFSET                      0x000404  /* Interrupt Enables for IRQ 0 */
#define RP2040_DMA_INTF0_OFFSET                      0x000408  /* Force Interrupts */
#define RP2040_DMA_INTS0_OFFSET                      0x00040c  /* Interrupt Status for IRQ 0 */
#define RP2040_DMA_INTE1_OFFSET                      0x000414  /* Interrupt Enables for IRQ 1 */
#define RP2040_DMA_INTF1_OFFSET                      0x000418  /* Force Interrupts for IRQ 1 */
#define RP2040_DMA_INTS1_OFFSET                      0x00041c  /* Interrupt Status (masked) for IRQ 1 */
#define RP2040_DMA_TIMER0_OFFSET                     0x000420  /* Pacing (X/Y) Fractional Timer The pacing timer produces TREQ assertions at a rate set by ((X/Y) * sys_clk). This equation is evaluated every sys_clk cycles and therefore can only generate TREQs at a rate of 1 per sys_clk (i.e. permanent TREQ) or less. */
#define RP2040_DMA_TIMER1_OFFSET                     0x000424  /* Pacing (X/Y) Fractional Timer The pacing timer produces TREQ assertions at a rate set by ((X/Y) * sys_clk). This equation is evaluated every sys_clk cycles and therefore can only generate TREQs at a rate of 1 per sys_clk (i.e. permanent TREQ) or less. */
#define RP2040_DMA_TIMER2_OFFSET                     0x000428  /* Pacing (X/Y) Fractional Timer The pacing timer produces TREQ assertions at a rate set by ((X/Y) * sys_clk). This equation is evaluated every sys_clk cycles and therefore can only generate TREQs at a rate of 1 per sys_clk (i.e. permanent TREQ) or less. */
#define RP2040_DMA_TIMER3_OFFSET                     0x00042c  /* Pacing (X/Y) Fractional Timer The pacing timer produces TREQ assertions at a rate set by ((X/Y) * sys_clk). This equation is evaluated every sys_clk cycles and therefore can only generate TREQs at a rate of 1 per sys_clk (i.e. permanent TREQ) or less. */
#define RP2040_DMA_MULTI_CHAN_TRIGGER_OFFSET         0x000430  /* Trigger one or more channels simultaneously */
#define RP2040_DMA_SNIFF_CTRL_OFFSET                 0x000434  /* Sniffer Control */
#define RP2040_DMA_SNIFF_DATA_OFFSET                 0x000438  /* Data accumulator for sniff hardware Write an initial seed value here before starting a DMA transfer on the channel indicated by SNIFF_CTRL_DMACH. The hardware will update this register each time it observes a read from the indicated channel. Once the channel completes, the final result can be read from this register. */
#define RP2040_DMA_FIFO_LEVELS_OFFSET                0x000440  /* Debug RAF, WAF, TDF levels */
#define RP2040_DMA_CHAN_ABORT_OFFSET                 0x000444  /* Abort an in-progress transfer sequence on one or more channels */
#define RP2040_DMA_N_CHANNELS_OFFSET                 0x000448  /* The number of channels this DMA instance is equipped with. This DMA supports up to 16 hardware channels, but can be configured with as few as one, to minimise silicon area. */
#define RP2040_DMA_DBG_CTDREQ_OFFSET(n)              (0x000800 + (n) * 0x0040)
#define RP2040_DMA_DBG_TCR_OFFSET(n)                 (0x000804 + (n) * 0x0040)

/* Register definitions *****************************************************/

#define RP2040_DMA_CH(n)                      (RP2040_DMA_BASE + (0x0040 * (n)))
#define RP2040_DMA_READ_ADDR(n)               (RP2040_DMA_CH(n) + RP2040_DMA_READ_ADDR_OFFSET)
#define RP2040_DMA_WRITE_ADDR(n)              (RP2040_DMA_CH(n) + RP2040_DMA_WRITE_ADDR_OFFSET)
#define RP2040_DMA_TRANS_COUNT(n)             (RP2040_DMA_CH(n) + RP2040_DMA_TRANS_COUNT_OFFSET)
#define RP2040_DMA_CTRL_TRIG(n)               (RP2040_DMA_CH(n) + RP2040_DMA_CTRL_TRIG_OFFSET)
#define RP2040_DMA_AL1_CTRL(n)                (RP2040_DMA_CH(n) + RP2040_DMA_AL1_CTRL_OFFSET)
#define RP2040_DMA_AL1_READ_ADDR(n)           (RP2040_DMA_CH(n) + RP2040_DMA_AL1_READ_ADDR_OFFSET)
#define RP2040_DMA_AL1_WRITE_ADDR(n)          (RP2040_DMA_CH(n) + RP2040_DMA_AL1_WRITE_ADDR_OFFSET)
#define RP2040_DMA_AL1_TRANS_COUNT_TRIG(n)    (RP2040_DMA_CH(n) + RP2040_DMA_AL1_TRANS_COUNT_TRIG_OFFSET)
#define RP2040_DMA_AL2_CTRL(n)                (RP2040_DMA_CH(n) + RP2040_DMA_AL2_CTRL_OFFSET)
#define RP2040_DMA_AL2_TRANS_COUNT(n)         (RP2040_DMA_CH(n) + RP2040_DMA_AL2_TRANS_COUNT_OFFSET)
#define RP2040_DMA_AL2_READ_ADDR(n)           (RP2040_DMA_CH(n) + RP2040_DMA_AL2_READ_ADDR_OFFSET)
#define RP2040_DMA_AL2_WRITE_ADDR_TRIG(n)     (RP2040_DMA_CH(n) + RP2040_DMA_AL2_WRITE_ADDR_TRIG_OFFSET)
#define RP2040_DMA_AL3_CTRL(n)                (RP2040_DMA_CH(n) + RP2040_DMA_AL3_CTRL_OFFSET)
#define RP2040_DMA_AL3_WRITE_ADDR(n)          (RP2040_DMA_CH(n) + RP2040_DMA_AL3_WRITE_ADDR_OFFSET)
#define RP2040_DMA_AL3_TRANS_COUNT(n)         (RP2040_DMA_CH(n) + RP2040_DMA_AL3_TRANS_COUNT_OFFSET)
#define RP2040_DMA_AL3_READ_ADDR_TRIG(n)      (RP2040_DMA_CH(n) + RP2040_DMA_AL3_READ_ADDR_TRIG_OFFSET)

